## Concatenación de dataframes

concatenar = a junta, unir o fusionar 

para dtaframes, existen tres formas de concatenar :

- Concat ( concatenar)
- Merge (fusionar)
- Join (unir)
-

# CONCAT 

esta técnica básicamente se centra en bases de datos, comunes y tiene las mismas columnas y por tanto hay que juntar las filas

In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame ({'A' :['1A', '2A'], 'B' : ['1B', '2B'], 'C' : ['1C', '2C']})
df2 = pd.DataFrame ({'A' :['6A', '7A', '8A'], 'B': ['6B', '7B', '8B'], 'C' : [ '6C', '7C', '8C']})

In [4]:
df1

    A   B   C
0  1A  1B  1C
1  2A  2B  2C

In [5]:
df2

    A   B   C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [7]:
pd.concat([df1, df2], ignore_index =True)

    A   B   C
0  1A  1B  1C
1  2A  2B  2C
2  6A  6B  6C
3  7A  7B  7C
4  8A  8B  8C

In [9]:
df1 = pd.DataFrame ({'A' :['1A', '2A'], 'B' : ['1B', '2B'], 'C' : ['1C', '2C'] , 'K' : ['1K', '2K']})
df2 = pd.DataFrame ({'A' :['6A', '7A', '8A'], 'B': ['6B', '7B', '8B'], 'C' : [ '6C', '7C', '8C']})

# Merge (fusionar)

Esta técnica fusiona diferentes dataframes a partir de una columna (clave) en común

In [16]:
df1 = pd.DataFrame ({'A' :['1A', '2A'], 'B' : ['1B', '2B']})
df2 = pd.DataFrame ({'A' :['1A', '2A'], 'C' : ['1C', '2C'], 'K' : ['1K', '2K']})

In [17]:
df1

    A   B
0  1A  1B
1  2A  2B

In [18]:
df2

    A   C   K
0  1A  1C  1K
1  2A  2C  2K

In [19]:
pd.merge(df1, df2, on = ['A'])

    A   B   C   K
0  1A  1B  1C  1K
1  2A  2B  2C  2K

In [21]:
df1 = pd.DataFrame ({'A' :['1A', '2A', '3A'], 'B' : ['1B', '2B', '3B']})
df2 = pd.DataFrame ({'A' :['5A', '6A'], 'C' : ['1C', '2C'], 'K' : ['1K', '2K']})

In [22]:
df1

    A   B
0  1A  1B
1  2A  2B
2  3A  3B

In [23]:
df2

    A   C   K
0  5A  1C  1K
1  6A  2C  2K

In [24]:
pd.merge(df1, df2, on = ['A'], how = 'outer')

    A    B    C    K
0  1A   1B  NaN  NaN
1  2A   2B  NaN  NaN
2  3A   3B  NaN  NaN
3  5A  NaN   1C   1K
4  6A  NaN   2C   2K

In [25]:
pd.merge(df1, df2, on = ['A'], how = 'left')

    A   B    C    K
0  1A  1B  NaN  NaN
1  2A  2B  NaN  NaN
2  3A  3B  NaN  NaN

# Join

la idea de este dtaframees combinar las columnas de dos dataframes indexados

In [28]:
df1 = pd.DataFrame ({'Z' :['1A', '2A', '3A'], 'B' : ['1B', '2B', '3B']}, index = ['i1', 'i2', 'i3'])
df2 = pd.DataFrame ({'A' :['5A', '6A'], 'C' : ['1C', '2C'], 'K' : ['1K', '2K']}, index = ['i1', 'i2'])

In [29]:
df1

     Z   B
i1  1A  1B
i2  2A  2B
i3  3A  3B

In [30]:
df2

     A   C   K
i1  5A  1C  1K
i2  6A  2C  2K

In [31]:
df1.join(df2)

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3B  NaN  NaN  NaN

# entradas y salidas

In [32]:
df3= df1.join(df2)
df3

     Z   B    A    C    K
i1  1A  1B   5A   1C   1K
i2  2A  2B   6A   2C   2K
i3  3A  3B  NaN  NaN  NaN

In [34]:
df3.to_csv('nombre.csv', index = False)

In [37]:
pd.read_csv ('otra cosa.csv')

    Z   B    A    C    K
0  1A  1B   5A   1C   1K
1  2A  2B   6A   2C   2K
2  3A  3B  NaN  NaN  NaN